ColinPan-China/TC37X_VCU/Appl/Source/IoHwAb_SWC.c
/**********************************************************************************************************************
 *  FILE REQUIRES USER MODIFICATIONS
 *  Template Scope: sections marked with Start and End comments
 *  -------------------------------------------------------------------------------------------------------------------
 *  This file includes template code that must be completed and/or adapted during BSW integration.
 *  The template code is incomplete and only intended for providing a signature and an empty implementation.
 *  It is neither intended nor qualified for use in series production without applying suitable quality measures.
 *  The template code must be completed as described in the instructions given within this file and/or in the.
 *  Technical Reference.
 *  The completed implementation must be tested with diligent care and must comply with all quality requirements which.
 *  are necessary according to the state of the art before its use.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 *  FILE DESCRIPTION
 *  -------------------------------------------------------------------------------------------------------------------
 *             File:  IoHwAb_SWC.c
 *           Config:  TC37X_VCU.dpa
 *        SW-C Type:  IoHwAb_SWC
 *
 *        Generator:  MICROSAR RTE Generator Version 4.26.0
 *                    RTE Core Version 1.26.0
 *          License:  CBD2101138
 *
 *      Description:  C-Code implementation template for SW-C <IoHwAb_SWC>
 *********************************************************************************************************************/


/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << Start of version logging area >>                DO NOT CHANGE THIS COMMENT!
 *********************************************************************************************************************/

/* PRQA S 0777, 0779 EOF */ /* MD_MSR_Rule5.1, MD_MSR_Rule5.2 */

/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << End of version logging area >>                  DO NOT CHANGE THIS COMMENT!
 *********************************************************************************************************************/

#include "Rte_IoHwAb_SWC.h"


/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << Start of include and declaration area >>        DO NOT CHANGE THIS COMMENT!
 *********************************************************************************************************************/
#include "vstdlib.h"
#include "Spi.h"
#include "IfxSrc_reg.h"
#include "Irq.h"
#include "TLE8888qk.h"
#include "Adc_Sample.h"
#include "TJA1145.h"
#include "Dio.h"
#include "PwmIf.h"
#include "TLE94108ES.h"
#include "Icu_17_TimerIp.h"
#include "SensorMng.h"
#include "TLE9201SG.h"
#include "Com.h"
/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << End of include and declaration area >>          DO NOT CHANGE THIS COMMENT!
 *********************************************************************************************************************/


#define IoHwAb_SWC_START_SEC_CODE
#include "IoHwAb_SWC_MemMap.h" /* PRQA S 5087 */ /* MD_MSR_MemMap */

/**********************************************************************************************************************
 *
 * Runnable Entity Name: IoHwAb_SWC_Init
 *
 *---------------------------------------------------------------------------------------------------------------------
 *
 * Executed once after the RTE is started
 *
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << Start of documentation area >>                  DO NOT CHANGE THIS COMMENT!
 * Symbol: IoHwAb_SWC_Init_doc
 *********************************************************************************************************************/
Icu_17_TimerIp_DutyCycleType ICU_Val1;
Icu_17_TimerIp_DutyCycleType ICU_Val2;
uint16 MessureFlg = 0;
/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << End of documentation area >>                    DO NOT CHANGE THIS COMMENT!
 *********************************************************************************************************************/

FUNC(void, IoHwAb_SWC_CODE) IoHwAb_SWC_Init(void) /* PRQA S 0624, 3206 */ /* MD_Rte_0624, MD_Rte_3206 */
{
/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << Start of runnable implementation >>             DO NOT CHANGE THIS COMMENT!
 * Symbol: IoHwAb_SWC_Init
 *********************************************************************************************************************/
  Adc_SampleInit();

  /*SPI Irq Init*/
  IRQ_SFR_MODIFY32 (SRC_QSPI3TX.U,  IRQ_CLEAR_MASK, \
                    ((uint32)IRQ_QSPI3_TX_TOS | (uint32) IRQ_QSPI3_TX_PRIO));
  IRQ_SFR_MODIFY32 (SRC_QSPI3RX.U,  IRQ_CLEAR_MASK, \
                    ((uint32)IRQ_QSPI3_RX_TOS | (uint32) IRQ_QSPI3_RX_PRIO));

  SRC_QSPI3RX.B.SRE 	= 1;
  SRC_QSPI3TX.B.SRE 	= 1;

  Tja1145_Init();
/*  Dio_WriteChannel( DioConf_DioChannel_DioChannel_P00_7_IN0, 1 );
  Dio_WriteChannel( DioConf_DioChannel_DioChannel_P00_8_IN1, 1 );
  Dio_WriteChannel( DioConf_DioChannel_DioChannel_P00_9_IN2, 1 );
  Dio_WriteChannel( DioConf_DioChannel_DioChannel_P00_10_IN3, 1 );*/

  Icu_17_TimerIp_StartSignalMeasurement(IcuConf_IcuChannel_IcuChannel_P34_2);
  Icu_17_TimerIp_StartSignalMeasurement(IcuConf_IcuChannel_IcuChannel_P34_4);
  Dio_WriteChannel(DioConf_DioChannel_DioChannel_P23_6_LIN_SLP,1);
  PwnIf_Start();
//  Tja1145_GoSleep();
  Tle94108es_Init();
  Tle9201sg_Init();
/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << End of runnable implementation >>               DO NOT CHANGE THIS COMMENT!
 *********************************************************************************************************************/
}

/**********************************************************************************************************************
 *
 * Runnable Entity Name: IoHwAb_SWC_Runnable
 *
 *---------------------------------------------------------------------------------------------------------------------
 *
 * Executed if at least one of the following trigger conditions occurred:
 *   - triggered on TimingEvent every 10ms
 *
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << Start of documentation area >>                  DO NOT CHANGE THIS COMMENT!
 * Symbol: IoHwAb_SWC_Runnable_doc
 *********************************************************************************************************************/
uint8 sts_SV = 0;
uint8 TIMER = 0;
static volatile uint8 Txmode = 0;
/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << End of documentation area >>                    DO NOT CHANGE THIS COMMENT!
 *********************************************************************************************************************/

FUNC(void, IoHwAb_SWC_CODE) IoHwAb_SWC_Runnable(void) /* PRQA S 0624, 3206 */ /* MD_Rte_0624, MD_Rte_3206 */
{
/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << Start of runnable implementation >>             DO NOT CHANGE THIS COMMENT!
 * Symbol: IoHwAb_SWC_Runnable
 *********************************************************************************************************************/
  Adc_SampleMain();
  TLE8888qk_Main();
  PwnIf_Main();
  Tle94108es_Main();
  Tle9201sg_Main();
  SensorMngMain();

  /*ICU Measurement*/
  MessureFlg++;
  if(MessureFlg >= 100 )
  {
    MessureFlg = 0;
    Icu_17_TimerIp_GetDutyCycleValues(IcuConf_IcuChannel_IcuChannel_P34_2, &ICU_Val1);
    Icu_17_TimerIp_GetDutyCycleValues(IcuConf_IcuChannel_IcuChannel_P34_4, &ICU_Val2);
    if( ICU_Val2.PeriodTime == 0 && ICU_Val1.PeriodTime == 0 )
    {
      NOP();
    }
  }

  Com_SwitchIpduTxMode( ComConf_ComIPdu_BCL_oJ1939_bms_e5f04d09_Tx,   Txmode );
  Com_SwitchIpduTxMode( ComConf_ComIPdu_BCP_oJ1939_bms_ece2ed74_Tx,   Txmode );
  Com_SwitchIpduTxMode( ComConf_ComIPdu_BCS_oJ1939_bms_9b7c3f84_Tx,   Txmode );
  Com_SwitchIpduTxMode( ComConf_ComIPdu_BEM_oJ1939_bms_deb0debb_Tx,   Txmode );
  Com_SwitchIpduTxMode( ComConf_ComIPdu_BHM_oJ1939_bms_999cbec5_Tx,   Txmode );
  Com_SwitchIpduTxMode( ComConf_ComIPdu_BMT_oJ1939_bms_1502dabb_Tx,   Txmode );
  Com_SwitchIpduTxMode( ComConf_ComIPdu_BMV_oJ1939_bms_f9394424_Tx,   Txmode );
  Com_SwitchIpduTxMode( ComConf_ComIPdu_BRM_oJ1939_bms_17c47e39_Tx,   Txmode );
  Com_SwitchIpduTxMode( ComConf_ComIPdu_BRO_oJ1939_bms_fbffe0a6_Tx,   Txmode );
  Com_SwitchIpduTxMode( ComConf_ComIPdu_BSD_oJ1939_bms_57fb9d2d_Tx,   Txmode );
  Com_SwitchIpduTxMode( ComConf_ComIPdu_BSM_oJ1939_bms_ca52a7bc_Tx,   Txmode );
  Com_SwitchIpduTxMode( ComConf_ComIPdu_BSOC_oJ1939_bms_5e951453_Tx,  Txmode );
  Com_SwitchIpduTxMode( ComConf_ComIPdu_BST_oJ1939_bms_5be370d1_Tx,   Txmode );

/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << End of runnable implementation >>               DO NOT CHANGE THIS COMMENT!
 *********************************************************************************************************************/
}


#define IoHwAb_SWC_STOP_SEC_CODE
#include "IoHwAb_SWC_MemMap.h" /* PRQA S 5087 */ /* MD_MSR_MemMap */


/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << Start of function definition area >>            DO NOT CHANGE THIS COMMENT!
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << End of function definition area >>              DO NOT CHANGE THIS COMMENT!
 *********************************************************************************************************************/


/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << Start of removed code area >>                   DO NOT CHANGE THIS COMMENT!
 *********************************************************************************************************************/


/**********************************************************************************************************************
 * DO NOT CHANGE THIS COMMENT!           << End of removed code area >>                     DO NOT CHANGE THIS COMMENT!
 *********************************************************************************************************************/

/**********************************************************************************************************************
 MISRA 2012 violations and justifications
 *********************************************************************************************************************/

/* module specific MISRA deviations:
   MD_Rte_0624:  MISRA rule: Rule8.3
     Reason:     This MISRA violation is a consequence from the RTE requirements [SWS_Rte_01007] [SWS_Rte_01150].
                 The typedefs are never used in the same context.
     Risk:       No functional risk. Only a cast to uint8* is performed.
     Prevention: Not required.

   MD_Rte_3206:  MISRA rule: Rule2.7
     Reason:     The parameter are not used by the code in all possible code variants.
     Risk:       No functional risk.
     Prevention: Not required.

*/
